from decimal import Decimal

datas = []
datas.append('(header)')
datas.append('G21G61G90')
datas.append('G00 Z5.000')
datas.append('G00 X0.000 Y0.000')
datas.append('M03')
datas.append('G00 Z1.000')

def hole(x=0.0, y=0.0, dia=1.0, dep=2.0, tw=0.8):
    lines = []
    ed = Decimal(0.2)
    sd = Decimal(0.0)
    rad = (Decimal(dia) - Decimal(tw)) / 2
    dx = Decimal(x)
    dy = Decimal(y)
    ddep = Decimal(dep)

    # move
    lines.append(f'G00 X{dx:.3f} Y{dy:.3f}')

    while sd < ddep:
        sd += ed
        # down
        lines.append(f'G01 Z-{sd:.3f} F100.000')
        # circle
        lines.append(f'G02 X{dx:.3f} Y{dy:.3f} I{rad:.3f} J0.000 F300.000')

    # up
    lines.append('G00 Z1.000')
    return lines

dep = 2.0
tool = 0.8

matrix_for_8 = [
    # [ x, y, dia]
    [ 0,  0, 0.86], # (0.86mmの穴をあける)
    [ 2,  0, 0.86],
    [ 4,  0, 0.86],
    [ 6,  0, 0.86],
    [ 8,  0, 0.86],
    [ 0,  2, 0.87], # (0.87mmの穴をあける)
    [ 2,  2, 0.87],
    [ 4,  2, 0.87],
    [ 6,  2, 0.87],
    [ 8,  2, 0.87],
    [ 0,  4, 0.88], # (0.88mmの穴をあける)
    [ 2,  4, 0.88],
    [ 4,  4, 0.88],
    [ 6,  4, 0.88],
    [ 8,  4, 0.88],
    [ 0,  6, 0.89], # (0.89mmの穴をあける)
    [ 2,  6, 0.89],
    [ 4,  6, 0.89],
    [ 6,  6, 0.89],
    [ 8,  6, 0.89],
    [ 0,  8, 0.90], # (0.90mmの穴をあける)
    [ 2,  8, 0.90],
    [ 4,  8, 0.90],
    [ 6,  8, 0.90],
    [ 8,  8, 0.90],
    [ 0, 10, 0.91], # (0.91mmの穴をあける)
    [ 2, 10, 0.91],
    [ 4, 10, 0.91],
    [ 6, 10, 0.91],
    [ 8, 10, 0.91],
    [ 0, 12, 0.92], # (0.92mmの穴をあける)
    [ 2, 12, 0.92],
    [ 4, 12, 0.92],
    [ 6, 12, 0.92],
    [ 8, 12, 0.92],
    [ 0, 14, 0.93], # (0.93mmの穴をあける)
    [ 2, 14, 0.93],
    [ 4, 14, 0.93],
    [ 6, 14, 0.93],
    [ 8, 14, 0.93],
    [ 0, 16, 0.94], # (0.94mmの穴をあける)
    [ 2, 16, 0.94],
    [ 4, 16, 0.94],
    [ 6, 16, 0.94],
    [ 8, 16, 0.94],
]

matrix_for_10 = [
    [ 10,  0, 1.06], # (1.06mmの穴をあける)
    [ 12,  0, 1.06],
    [ 14,  0, 1.06],
    [ 16,  0, 1.06],
    [ 18,  0, 1.06],
    [ 10,  2, 1.07], # (1.07mmの穴をあける)
    [ 12,  2, 1.07],
    [ 14,  2, 1.07],
    [ 16,  2, 1.07],
    [ 18,  2, 1.07],
    [ 10,  4, 1.08], # (1.08mmの穴をあける)
    [ 12,  4, 1.08],
    [ 14,  4, 1.08],
    [ 16,  4, 1.08],
    [ 18,  4, 1.08],
    [ 10,  6, 1.09], # (1.09mmの穴をあける)
    [ 12,  6, 1.09],
    [ 14,  6, 1.09],
    [ 16,  6, 1.09],
    [ 18,  6, 1.09],
    [ 10,  8, 1.10], # (1.10mmの穴をあける)
    [ 12,  8, 1.10],
    [ 14,  8, 1.10],
    [ 16,  8, 1.10],
    [ 18,  8, 1.10],
    [ 10, 10, 1.11], # (1.11mmの穴をあける)
    [ 12, 10, 1.11],
    [ 14, 10, 1.11],
    [ 16, 10, 1.11],
    [ 18, 10, 1.11],
    [ 10, 12, 1.12], # (1.12mmの穴をあける)
    [ 12, 12, 1.12],
    [ 14, 12, 1.12],
    [ 16, 12, 1.12],
    [ 18, 12, 1.12],
    [ 10, 14, 1.13], # (1.13mmの穴をあける)
    [ 12, 14, 1.13],
    [ 14, 14, 1.13],
    [ 16, 14, 1.13],
    [ 18, 14, 1.13],
    [ 10, 16, 1.14], # (1.14mmの穴をあける)
    [ 12, 16, 1.14],
    [ 14, 16, 1.14],
    [ 16, 16, 1.14],
    [ 18, 16, 1.14],
]

for hl in matrix_for_8:
    datas += hole(hl[0], hl[1], hl[2], dep=dep, tw=tool)

for hl in matrix_for_10:
    datas += hole(hl[0], hl[1], hl[2], dep=dep, tw=tool)

datas.append('(Footer)')
datas.append('G61')
datas.append('G00 Z5.000')
datas.append('G00 X0.000 Y0.000')
datas.append('M30')

print("\n".join(datas))